Praktikum7_DinaIzzatiElfadheya/app/Controllers/Auth.php

    public function loginPost()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

    public function registerPost()
    {
        $userModel = new UserModel();

        if (!$this->validate([
            'username' => 'required|min_length[3]|max_length[100]|is_unique[users.username]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'password_confirm' => 'matches[password]'
        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }
        $userModel->insert([
            'username' => $this->request->getPost('username'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
        ]);
---
INSERT INTO `users` (`username`, `email`, `password`) VALUES ('izzati', 'izatizat315@gmail.com', '$2y$10$VZmUoFka6fieH/qvnCh6C.93mLn6BA4G5mvQKYVe5l7BTghqcfF6.')