Praktikum7_DinaIzzatiElfadheya/app/Controllers/Dashboard.php

    public function index()
    {
        // Cek apakah user sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll(); // Ambil semua data buku
---
SELECT *
FROM `books`